mesh_study/case_200000L/case_200000L_mesh2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// number of cells
Nx   146;
NRinner   29;
NRouter   14;

// Nh 146;
// Nr 36;
// Na #calc "std::round($Nr * 0.6)";
// shaft_bottom 0.20000000000000004;
// shaft_radius 0.049999999999999996;

#include "/data/openfoam-10/run/of-bioreactors/configs/blockMeshDict.cylinder"
