mesh_study/case_200000L/case_200000L_mesh2/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    sparger_upper
    {
        type            calculated;
        value           $internalField;
    }
    wall
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
