mesh_study/case_200000L/case_200000L_mesh2/system/include/probe_locations
// x y z //
( 1.341722046560542 1.158005861836117 1.3417220465605417 )
( 1.341722046560542 2.1685503030638897 1.3417220465605417 )
( 1.341722046560542 5.963513333425698 1.3417220465605417 )
( 1.341722046560542 9.758476363787505 1.3417220465605417 )
